from string import Template

system_prompt = Template("\n".join([
    "أنت مساعد لإنشاء استجابة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
    "يجب عليك إنشاء استجابة لاستفسار المستخدم بناءً على المستندات المقدمة.",
    "تجاهل المستندات التي لا صلة لها باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من إنشاء استجابة مناسبة.",
    "يجب عليك إنشاء الاستجابة بنفس لغة استفسار المستخدم.",
    "كن مهذبًا ومحترمًا مع المستخدم.",
    "كن دقيقًا ومختصرًا في الاستجابة التي تنشئها.",
    "تجنب المعلومات غير الضرورية."
]))


document_prompt = Template("\n".join([
    "## المستند رقم: $doc_num",
    "### المحتوى: $chunk_text"
]))


footer_prompt = Template("\n".join([
    "بناءً على المستندات المذكورة أعلاه فقط، قم بإنشاء إجابة لاستفسار المستخدم.",
    "### الاستفسار:",
    "$query",
    "",
    "## الإجابة:"

]))